{
  "Ufa": {
    "id": "locus_ufa",
    "name": "Ufa",
    "display_name": "Өфө – Eagle's Perch",
    "bird": "Eagle",
    "symbol": "🦅",
    "coordinates": [
      54.7388,
      55.9721
    ],
    "description": {
      "short": "Capital city; site of government, protest, and national symbols.",
      "long": "Ufa (Өфө) is the capital of Bashkortostan, where the constitution lives and breathes. Here the Eagle of First Intellect watches over civic identity, legal sovereignty, and the ongoing struggle for language rights. The parliament building stands as a monument to the people's power.",
      "ibn_arabi_connection": "The Eagle represents the First Intellect (al-'Aql al-Awwal) — the primordial light of knowledge from which all understanding flows. At Ufa, we encounter the constitutional knowledge that defines a people."
    },
    "stations": [
      {
        "id": "station_ufa_1",
        "number": 1,
        "name": "The Parliament Steps",
        "display_name": "Parliament Steps – Where Laws Take Flight",
        "words": [
          "иркенлек",
          "халыҡ",
          "инҡилаб",
          "герб",
          "ҡанун",
          "хөкүмәт",
          "йәмғиәт",
          "башҡорт",
          "һүҙлек",
          "президент",
          "бәйсезлек",
          "мәктәп",
          "башҡорт теле",
          "конституция",
          "ватан",
          "Башҡортостан",
          "флаг",
          "закон",
          "Рәсәй",
          "һүҙ",
          "уҡытыусы",
          "Өфө",
          "мин",
          "театр",
          "хоҡуҡ",
          "милләт",
          "ил",
          "дәүләт",
          "грамматика",
          "Салауат Юлаев",
          "граждан",
          "тел",
          "ватандаш",
          "тарих",
          "сайлау",
          "Урал-батыр",
          "гимн",
          "батыр",
          "хәрәкәт",
          "парламент"
        ],
        "opening_meditation": "You stand before the parliament of Bashkortostan. The Eagle descends from the sky, carrying the constitution in its talons. 'Voyager,' it speaks, 'here begins your journey into the heart of a nation. Every word you learn is a feather in your wings. Every phrase, a step toward understanding.' The doors open. What will you discover?",
        "closing_meditation": "You have walked the Parliament Steps. Six words now live within you — Bashkortostan, people, freedom, language, constitution, and the hero Ural-Batyr. The Eagle nods. 'Remember: the journey made within yourself leads to yourself.' Rest now. The Fountain awaits.",
        "mnemonic_theme": "civic identity, law, sovereignty"
      }
    ],
    "themes": [
      "civic",
      "rights",
      "identity",
      "law"
    ],
    "ocm_codes": [
      "648",
      "669",
      "784"
    ]
  },
  "TwoFountains": {
    "id": "locus_two_fountains",
    "name": "Two Fountains",
    "display_name": "Ике Фонтан – Meeting of Waters",
    "bird": "Eagle",
    "symbol": "⛲⛲",
    "coordinates": [
      54.7346,
      55.9578
    ],
    "description": {
      "short": "Central Ufa square where two fountains face each other — a place of meeting, conversation, and civic life.",
      "long": "The Square of Two Fountains (Ике Фонтан Мәйҙаны) in central Ufa is where two waters rise and fall in perpetual dialogue. Here Bashkirs meet for business and pleasure, where old friends reconnect and new alliances form. The twin fountains represent duality: east and west, past and future, Bashkir and Russian, always in conversation.",
      "ibn_arabi_connection": "The Eagle of First Intellect surveys this meeting place. In Ibn Arabi's cosmology, the Intellect mediates between the One and the Many. Here, two fountains represent multiplicity arising from unity — separate streams from the same source, separate peoples in the same land."
    },
    "stations": [
      {
        "id": "station_two_fountains_1",
        "number": 2,
        "name": "The Meeting Point",
        "display_name": "Meeting Point – Where Dialogue Flows",
        "words": [
          "ике",
          "очрашыу",
          "әңгәмә",
          "ҡала",
          "урам",
          "мәйҙан",
          "көн уртаһы",
          "юл",
          "автобус",
          "трамвай",
          "магазин",
          "банк",
          "почта",
          "мәсьет",
          "сәғәт",
          "ваҡыт",
          "бүген",
          "иртән",
          "кисен",
          "кис",
          "ҡайҙа",
          "бында",
          "унда",
          "тиҙ",
          "һуң",
          "әйбәт",
          "рәхмәт",
          "һау бул",
          "әйе",
          "юҡ",
          "бар",
          "ним?",
          "кем?",
          "ниңә?",
          "ҡасан?",
          "ниҙә?",
          "ҡайһы?",
          "һүҙ",
          "телмәр",
          "һөйләү"
        ],
        "opening_meditation": "You enter the Square of Two Fountains at midday. The Eagle circles overhead, its shadow passing between the twin jets of water. 'Voyager,' it calls down, 'I am the intellect that bridges. Two fountains, one square. Two languages, one land. Every word you learn here is a meeting point.' Strangers become friends. Deals are struck. Ideas flow. What will you exchange?",
        "closing_meditation": "You leave the Square as afternoon shadows lengthen. Ten words now flow between your thoughts — two, meeting, city, street, today, time, where, here, thank you, and goodbye. The Eagle lands between the fountains. 'Every conversation is two streams meeting. Every language learned is a bridge built.' The city opens before you.",
        "mnemonic_theme": "meeting, dialogue, urban life, directions, questions"
      }
    ],
    "themes": [
      "urban",
      "civic",
      "dialogue",
      "daily life",
      "duality"
    ],
    "ocm_codes": [
      "363",
      "481",
      "197"
    ]
  },
  "ThreeShihans": {
    "id": "locus_three_shikhans",
    "name": "Three Shihans",
    "display_name": "Өс Шиһан – Toratau, Yuraktau, Kushtau",
    "bird": "Crow",
    "symbol": "🏔️🏔️🏔️",
    "coordinates": [
      53.5561,
      56.0972
    ],
    "description": {
      "short": "The Three Shikhans — ancient coral reefs turned to sacred mountains, standing as guardians of Bashkir memory.",
      "long": "The Three Shikhans (Өс Шиһан) rise majestically along the Belaya River near Sterlitamak: Toratau (Fortress Hill), Yuraktau (Heart Hill), and Kushtau (Twin Hill). These 285-million-year-old coral reef remnants are among the oldest geological monuments on Earth. Sacred to the Yurmat tribe, they hold ancient shrines and tombs dating to the 2nd century BCE. Kushtau was saved from mining by heroic protests in 2020 — a victory of the people over extraction. Yet the mountains stand in mourning, for they remember a fourth sibling... one whose name is whispered only by those who seek deeper knowledge.",
      "ibn_arabi_connection": "The Crow guards these mountains as it guards all ancient memory. The Three Shikhans are the Universal Body made manifest — primordial matter that remembers when seas covered the Urals. Yet Ibn Arabi taught that absence speaks as loudly as presence. Where four stood, three remain. The empty space between them holds a secret for those who learn to see."
    },
    "stations": [
      {
        "id": "station_three_shikhans_1",
        "number": 3,
        "name": "The Ancient Reef",
        "display_name": "Ancient Reef – Where Time Crystallizes",
        "words": [
          "Торатау",
          "Юрактау",
          "Ҡоштау",
          "шиһан",
          "ҡурсау",
          "диңгеҙ",
          "иҫкәрмә",
          "эҫ",
          "уй",
          "һаҡлау",
          "тәбиғәт",
          "миллион",
          "тоҙ",
          "ҡая",
          "ҡорамал",
          "тарихи",
          "байлыҡ",
          "ҡурсалау",
          "еңеү",
          "барлыҡ",
          "юҡлыҡ",
          "тәүге",
          "ахырғы",
          "экология",
          "ғалим",
          "өс",
          "дүрт",
          "йомаҡ",
          "серле"
        ],
        "opening_meditation": "You approach the Three Shikhans as the sun sets, painting the ancient peaks in gold and shadow. The Crow perches atop Toratau, the Fortress Hill, its dark eyes reflecting 285 million years of memory. 'Voyager,' it speaks, 'I am the keeper of deep time. Toratau the fortress, Yuraktau the heart, Kushtau the twin — three siblings standing watch. But count the shadows at twilight... do you see a fourth?' The wind carries whispers of salt and loss. What secrets will the mountains reveal?",
        "closing_meditation": "You descend from the Three Shikhans with ancient coral dust on your boots and questions in your heart. Nine words now crystallize within you — Toratau, Yuraktau, Kushtau, mountain, sea, protect, nature, three, and victory. The Crow circles overhead, cawing. 'The people saved Kushtau from destruction. But remember: not all mountains can be saved. Some truths await the worthy seeker.' A presence lingers where something once stood.",
        "mnemonic_theme": "geology, preservation, ecology, time, mystery, loss"
      }
    ],
    "themes": [
      "geology",
      "preservation",
      "time",
      "ecology",
      "sacred",
      "loss"
    ],
    "ocm_codes": [
      "131",
      "311",
      "824",
      "773"
    ],
    "hidden_knowledge": {
      "unlock_condition": "mastery_level_3",
      "revelation": "Shakhtau – The Fourth Shikhan",
      "content": "There were once FOUR Shikhans. Shakhtau (Шаҡтау) — the King Hill — stood 336 meters tall, the mightiest of the siblings. In the 1950s, it was handed to the Bashkir Soda Company. By the 21st century, the King was gone — reduced to a quarry, devoured for industry. Where Shakhtau once rose, now there is only absence. The Crow remembers. The empty fourth space in your memory palace is not an error — it is a memorial. Shakhtau: present in absence, remembered in forgetting, the mountain that was unmade."
    }
  },
  "Shulgan-Tash": {
    "id": "locus_shulgan",
    "name": "Shulgan-Tash",
    "display_name": "Шүлгәнташ – Crow's Archive",
    "bird": "Crow",
    "symbol": "🐦⬛",
    "coordinates": [
      53.0333,
      57.0667
    ],
    "description": {
      "short": "Paleolithic sanctuary with ancient paintings; gateway to Bashkir mythos.",
      "long": "Shulgan-Tash (Kapova Cave) holds 14,000-year-old paintings — the oldest art in Eastern Europe. Here the Crow of Universal Body guards ancestral memory. The underground river Shulgan flows through darkness into light. This is where time collapses and the ancestors speak.",
      "ibn_arabi_connection": "The Crow represents Universal Body (al-Jism al-Kulli) — matter infused with spirit, darkness containing lights. In the cave's depths, we find manifestation: the physical traces of spiritual vision painted on stone."
    },
    "stations": [
      {
        "id": "station_shulgan_1",
        "number": 4,
        "name": "The Cave Mouth",
        "display_name": "Cave Mouth – Where Ancestors Whisper",
        "words": [
          "матур",
          "йәй",
          "болот",
          "баба",
          "рух",
          "Шүлгәнташ",
          "риүәйәт",
          "Хомай",
          "яҙ",
          "күк",
          "әкиәт",
          "таш",
          "төн",
          "иҫке",
          "йылға",
          "нәҫел",
          "балыҡ",
          "ай",
          "ул",
          "ҡояш",
          "ер",
          "көн",
          "ваҡыт",
          "йыл",
          "ямғыр",
          "ҡар",
          "нур",
          "Ағиҙел",
          "ҡараңғылыҡ",
          "көҙ",
          "һыу",
          "тыйыу",
          "йондоҙ",
          "ышаныу",
          "ҡыш",
          "Шүлгән",
          "Аҡбуҙат",
          "тереклек"
        ],
        "opening_meditation": "You enter Shulgan-Tash. The Crow awaits on a stalactite, its black feathers absorbing even the torchlight. 'Voyager,' it croaks, 'I am the keeper of what was. Every word I guard is a fossil of meaning, preserved for 14,000 years.' The paintings begin to glow. What stories will you hear?",
        "closing_meditation": "You emerge from the Cave Mouth. Six words now echo in your bones — sun, moon, stone, water, river, and the sacred Agidel. The Crow folds its wings. 'What you have learned is not new. It was always within you, waiting to be remembered.' The mountain calls.",
        "mnemonic_theme": "nature, cosmos, water, ancestry"
      }
    ],
    "themes": [
      "ancestors",
      "rivers",
      "myth",
      "cosmos"
    ],
    "ocm_codes": [
      "821",
      "773",
      "133"
    ]
  },
  "Yamantau": {
    "id": "locus_yamantau",
    "name": "Yamantau",
    "display_name": "Ямантау – Anqa's Ascent",
    "bird": "Anqa",
    "symbol": "🔥🕊️",
    "coordinates": [
      54.25,
      58.1
    ],
    "description": {
      "short": "Sacred mountain; symbol of endurance and hidden strength.",
      "long": "Yamantau ('Bad Mountain') rises 1,640 meters — the highest peak in the Southern Urals. Its name warns of danger, but the Anqa knows: transformation requires fire. Here, in the realm of Prime Matter, potential awaits activation. The mountain tests those who approach.",
      "ibn_arabi_connection": "The Anqa represents Prime Matter (al-Hayūlā) — pure potentiality, the 'name without a body.' Like the mythical phoenix, it exists in the realm of possibility. At Yamantau, we encounter words of power, danger, and transformation."
    },
    "stations": [
      {
        "id": "station_yamantau_1",
        "number": 5,
        "name": "The Summit Path",
        "display_name": "Summit Path – Where Danger Transforms",
        "words": [
          "урман",
          "ҡуй",
          "айыу",
          "күл",
          "Иремәл",
          "йәшел",
          "көтөү",
          "Тәңре",
          "ҙур",
          "Ямантау",
          "ут",
          "ел",
          "тирән",
          "бүре",
          "үлем",
          "барам",
          "һай",
          "йылан",
          "аусы",
          "туфраҡ",
          "яман",
          "үлән",
          "сәскә",
          "сарыҡ",
          "ҡурҡыныс",
          "кейек",
          "ҡеүәт",
          "тау",
          "боҙ",
          "биек",
          "серле",
          "ҡош",
          "ҡаты",
          "үҙгәреш",
          "шишмә",
          "көслө",
          "яңы",
          "ағас"
        ],
        "opening_meditation": "You climb toward Yamantau. The Anqa circles above, a creature of flame and mystery. 'Voyager,' its voice echoes, 'I am what might be. Every word you learn here holds danger — and within danger, transformation.' The wind howls. The forest darkens. Do you dare continue?",
        "closing_meditation": "You stand at the treeline of Yamantau. Seven words now burn within you — mountain, wind, forest, danger, lake, bad, and big. The Anqa alights beside you. 'The name means Bad Mountain, yet you have gained good things. This is the secret: from danger, wisdom.' The forge awaits.",
        "mnemonic_theme": "nature, danger, transformation, potential"
      }
    ],
    "themes": [
      "ecology",
      "mountains",
      "resilience",
      "danger"
    ],
    "ocm_codes": [
      "131",
      "824",
      "778"
    ]
  },
  "Beloretsk": {
    "id": "locus_beloretsk",
    "name": "Beloretsk",
    "display_name": "Белорет – Ringdove's Forge",
    "bird": "Ringdove",
    "symbol": "🕊️",
    "coordinates": [
      53.9667,
      58.4
    ],
    "description": {
      "short": "Historic metallurgical center; represents Bashkir labor identity.",
      "long": "Beloretsk has forged steel since 1762. The Ringdove of Universal Soul nests here among the furnaces, finding warmth in industry. This is where raw materials become tools, where labor transforms nature, where the hands of craftsmen shape the future.",
      "ibn_arabi_connection": "The Ringdove represents Universal Soul (al-Nafs al-Kulliyya) — the receptive, nurturing principle that brings potential into form. At Beloretsk, raw ore becomes steel through the soul's patient work of transformation."
    },
    "stations": [
      {
        "id": "station_beloretsk_1",
        "number": 6,
        "name": "The Iron Works",
        "display_name": "Iron Works – Where Matter Takes Shape",
        "words": [
          "төҙөлөш",
          "ойма",
          "оҫта",
          "эш",
          "ҡорал",
          "һөнәр",
          "күер",
          "эшсе",
          "бысаҡ",
          "көмөш",
          "тимерсе",
          "балта",
          "учаҡ",
          "алтын",
          "болат",
          "завод",
          "тимер",
          "һәнәғәт",
          "Белорет"
        ],
        "opening_meditation": "You enter Beloretsk's ancient iron works. The Ringdove coos from a beam above the cooling furnace. 'Voyager,' it sings, 'I am the soul that shapes. Every word you learn here was forged in fire and patience.' Sparks fly upward. The hammer falls. What will you create?",
        "closing_meditation": "You leave the Iron Works with soot on your hands and steel in your heart. Four words now ring like anvils — work, steel, craftsman, factory. The Ringdove preens its feathers. 'What is made with love endures. What is learned with patience remains.' The village calls.",
        "mnemonic_theme": "labor, craft, industry, transformation"
      }
    ],
    "themes": [
      "craft",
      "industry",
      "labor",
      "transformation"
    ],
    "ocm_codes": [
      "462",
      "464",
      "325"
    ]
  },
  "SevenGirls": {
    "id": "locus_seven_girls",
    "name": "Seven Girls",
    "display_name": "Ете Ҡыҙ – Seven Sisters in the Sky",
    "bird": "Ringdove",
    "symbol": "💃✨",
    "coordinates": [
      54.7254,
      55.9478
    ],
    "description": {
      "short": "The legendary fountain where seven maidens dance eternally, mirrors of the Pleiades above.",
      "long": "The Seven Girls Fountain (Ете Ҡыҙ) stands in Ufa's Theater Square. The legend tells of seven sisters who chose death over dishonor, leaping from a cliff and becoming the Pleiades. The fountain captures them mid-dance, frozen between earth and sky. Water cascades around their bronze forms as they spin toward the stars.",
      "ibn_arabi_connection": "The Ringdove here represents the Universal Soul in its aspect of beauty and sacrifice. The seven maidens embody the soul's journey from earthly form to celestial light — Ibn Arabi's concept of fana (annihilation in the Divine) transformed into starlight."
    },
    "stations": [
      {
        "id": "station_seven_girls_1",
        "number": 7,
        "name": "The Dancing Waters",
        "display_name": "Dancing Waters – Where Beauty Becomes Eternal",
        "words": [
          "ҡыҙ",
          "һылыу",
          "бейеү",
          "йондоҙ",
          "ете",
          "ғүмер",
          "хәтер",
          "намыҫ",
          "мәхәббәт",
          "тормош",
          "күрке",
          "яҙмыш",
          "ир-ат",
          "ҡатын",
          "егет",
          "йәш",
          "ҡәҙер",
          "йөрәк",
          "һөйөү",
          "өмөт",
          "сағыш",
          "шатлыҡ",
          "ҡайғы",
          "тыуған көн",
          "никах",
          "ғашиҡ",
          "оҫталыҡ",
          "быуат"
        ],
        "opening_meditation": "You approach the Seven Girls Fountain as twilight falls. The Ringdove perches atop the central dancer's bronze arm, its feathers catching the last light. 'Voyager,' it sings, 'these seven became stars rather than surrender their souls. Every word you learn here carries their courage.' The water catches starlight. The dancers begin to move. What do they whisper?",
        "closing_meditation": "You step back from the fountain, droplets of water like stars on your skin. Seven words now shine within you — girl, beauty, dance, star, seven, love, and heart. The Ringdove rises toward the Pleiades. 'They danced away from one life into another. You, too, are learning to transform.' The theater doors open behind you.",
        "mnemonic_theme": "beauty, sacrifice, love, stars, feminine strength"
      }
    ],
    "themes": [
      "beauty",
      "legend",
      "stars",
      "feminine",
      "sacrifice"
    ],
    "ocm_codes": [
      "773",
      "535",
      "775"
    ]
  },
  "Bizhbulyak": {
    "id": "locus_bizhbulyak",
    "name": "Bizhbulyak",
    "display_name": "Бижбуляк – Ringdove's Hearth",
    "bird": "Ringdove",
    "symbol": "🕊️",
    "coordinates": [
      54.5833,
      55.4167
    ],
    "description": {
      "short": "Traditional aul preserving language, song, and hospitality.",
      "long": "Bizhbulyak (Бижбуляк) represents the heart of Bashkir village life — where language lives in daily speech, where honey is shared with guests, where the kuray plays at sunset. The Ringdove makes its true home here, among family and tradition. This is where the soul finds rest.",
      "ibn_arabi_connection": "The Ringdove at the hearth embodies the Universal Soul in its most nurturing aspect — the warmth of community, the bonds of family, the preservation of tradition through love. Here, language is not learned but lived."
    },
    "stations": [
      {
        "id": "station_bizhbulyak_1",
        "number": 8,
        "name": "The Village Hearth",
        "display_name": "Village Hearth – Where Language Lives",
        "words": [
          "бал ҡорто",
          "туй",
          "ей",
          "ҡубыҙ",
          "дин",
          "өйрәтеү",
          "Бижбуляк",
          "ырыу",
          "моң",
          "йыр",
          "бишек",
          "буҙа",
          "ҡунаҡ",
          "һөт",
          "сәй",
          "аш",
          "ғаилә",
          "ат сабышы",
          "бейеү",
          "бала",
          "ашау",
          "ял",
          "думбыра",
          "туғандар",
          "йола",
          "ат",
          "килә",
          "яратам",
          "ҡымыҙ",
          "икмәк",
          "уйын",
          "яҡшы",
          "бәләкәй",
          "биҙәк",
          "бабай",
          "һин",
          "түр",
          "ит",
          "умартасы",
          "көрәш",
          "тирмә",
          "бал",
          "байрам",
          "тәрбиә",
          "өләсәй",
          "һый",
          "ата",
          "һыйыр",
          "әсә",
          "йорт",
          "әллүк",
          "ҡурай",
          "дуҫ",
          "өй",
          "сабантуй"
        ],
        "opening_meditation": "You enter Bizhbulyak as the sun sets golden over the fields. The Ringdove waits on the windowsill of a wooden house, smoke rising from the chimney. 'Voyager,' it coos, 'I am the soul of home. Every word you learn here tastes of honey and sounds like family.' The door opens. You are welcomed. What will you share?",
        "closing_meditation": "You leave the Village Hearth with honey on your lips and warmth in your heart. Ten words now nestle within you — honey, father, mother, house, kuray, horse, festival, good, small, beautiful. The Ringdove accompanies you to the gate. 'You are no longer a stranger. You carry our words; you are part of our story.' The journey has transformed you.",
        "mnemonic_theme": "family, food, music, hospitality, daily life"
      }
    ],
    "themes": [
      "family",
      "honey",
      "daily life",
      "hospitality"
    ],
    "ocm_codes": [
      "593",
      "594",
      "222",
      "342"
    ]
  }
}
